tienlonghungson/Hands-On-Embedded-System/Keil5/C51/INC/Cygnal/REG51F550.H
/*-----------------------------------------------------------------------------
  REG51F550.H

Header file for Silabs C8051F55x, C8051F560, and C8051F570 devices.
Copyright (c) 2011 ARM Ltd and ARM Germnay GmbH.
All rights reserved.
-----------------------------------------------------------------------------*/


#ifndef __REG51F550_H__
#define __REG51F550_H__

/* SFRPage 0x00 and SFRPage 0x0F Registers */
sfr P0          = 0x80;            /* Port 0 Latch                           */
sfr SP          = 0x81;            /* Stack Pointer                          */
sfr DPL         = 0x82;            /* Data Pointer Low                       */
sfr DPH         = 0x83;            /* Data Pointer High                      */
sfr SFR0CN      = 0x84;            /* SFR Page Control                       */
sfr SFRNEXT     = 0x85;            /* SFR stack next page                    */
sfr SFRLAST     = 0x86;            /* SFR stack last page                    */
sfr PCON        = 0x87;            /* Power Control                          */
sfr TCON        = 0x88;            /* Timer/Counter Control                  */
sfr TMOD        = 0x89;            /* Timer/Counter Mode                     */
sfr TL0         = 0x8A;            /* Timer/Counter 0 Low                    */
sfr TL1         = 0x8B;            /* Timer/Counter 1 Low                    */
sfr TH0         = 0x8C;            /* Timer/Counter 0 High                   */
sfr TH1         = 0x8D;            /* Timer/Counter 1 High                   */
sfr CKCON       = 0x8E;            /* Clock Control                          */
sfr PSCTL       = 0x8F;            /* Program Store R/W Control              */
sfr CLKSEL      = 0x8F;            /* System clock select                    */
sfr P1          = 0x90;            /* Port 1 Latch                           */
sfr TMR3CN      = 0x91;            /* Timer/Counter 3 Control                */
sfr TMR3RLL     = 0x92;            /* Timer/Counter 3 Reload Low             */
sfr TMR3RLH     = 0x93;            /* Timer/Counter 3 Reload High            */
sfr TMR3L       = 0x94;            /* Timer/Counter 3 Low                    */
sfr TMR3H       = 0x95;            /* Timer/Counter 3 High                   */
sfr CLKMUL      = 0x97;            /* Clock Multiplier                       */
sfr SCON0       = 0x98;            /* UART0 Control                          */
sfr SBUF0       = 0x99;            /* UART0 Data Buffer                      */
sfr CPT0CN      = 0x9A;            /* Comparator 0 Control                   */
sfr CPT0MD      = 0x9B;            /* Comparator 0 Mode                      */
sfr CPT0MX      = 0x9C;            /* Comparator 0 Mux                       */
sfr CPT1CN      = 0x9D;            /* Comparator 1 Control                   */
sfr CPT1MD      = 0x9E;            /* Comparator 0 Mode                      */
sfr OSCIFIN     = 0x9E;            /* Internal Oscillator Fine Control       */
sfr CPT1MX      = 0x9F;            /* Comparator 1 Mux                       */
sfr OSCXCN      = 0x9F;            /* External Oscillator Control            */
sfr P2          = 0xA0;            /* Port 2 Latch                           */
sfr SPI0CFG     = 0xA1;            /* SPI0 Configuration                     */
sfr OSCICN      = 0xA1;            /* Internal Oscillator Control            */
sfr SPI0CKR     = 0xA2;            /* SPI0 Clock rate control                */
sfr OSCICRS     = 0xA2;            /* Internal Oscillator Coarse Control     */
sfr SPI0DAT     = 0xA3;            /* SPI0 Data Buffer                       */
sfr P0MDOUT     = 0xA4;            /* Port 0 Output Mode                     */
sfr P1MDOUT     = 0xA5;            /* Port 1 Output Mode                     */
sfr P2MDOUT     = 0xA6;            /* Port 2 Output Mode                     */
sfr SFRPAGE     = 0xA7;            /* SFR Page Select                        */
sfr IE          = 0xA8;            /* Interrupt Enable                       */
sfr SMOD0       = 0xA9;            /* Serial Port 0 Control                  */
sfr EMI0CN      = 0xAA;            /* EMIF control                           */
sfr EMI0TC      = 0xAA;            /* EMIF Timing control                    */
sfr SBCON0      = 0xAB;            /* UART0 Baud Rate Generator Control      */
sfr SBRLL0      = 0xAC;            /* UART0 Baud Rate Generator Low          */
sfr SBRLH0      = 0xAD;            /* UART0 Baud Rate Generator High         */
sfr P3MAT       = 0xAE;            /* Port 3 Match                           */
sfr P3MDOUT     = 0xAE;            /* Port 3 Mode                            */
sfr P3MASK      = 0xAF;            /* Port 3 Mask                            */
sfr P4MDOUT     = 0xAF;            /* Port 4 Mode                            */
sfr P3          = 0xB0;            /* Port 3 Latch                           */
sfr P2MAT       = 0xB1;            /* Port 2 Match                           */
sfr P2MASK      = 0xB2;            /* Port 2 Mask                            */
sfr EMI0CF      = 0xB2;            /* EMIF Configuration                     */
sfr P4          = 0xB5;            /* Port 4 Latch                           */
sfr FLSCL       = 0xB6;            /* Flash Scale                            */
sfr FLKEY       = 0xB7;            /* Flash access limit                     */
sfr IP          = 0xB8;            /* Interrupt Priority                     */
sfr SMB0ADR     = 0xB9;            /* SMBus0 Slave address                   */
sfr ADC0TK      = 0xBA;            /* ADC0 Tracking Mode Select              */
sfr SMB0ADM     = 0xBA;            /* SMBus0 Address Mask                    */
sfr ADC0MX      = 0xBB;            /* AMUX0 Channel select                   */
sfr ADC0CF      = 0xBC;            /* AMUX0 Channel configuration            */
sfr ADC0L       = 0xBD;            /* ADC0 Data Low                          */
sfr ADC0H       = 0xBE;            /* ADC0 Data High                         */
sfr SMB0CN      = 0xC0;            /* SMBus0 Control                         */
sfr SMB0CF      = 0xC1;            /* SMBus0 Configuration                   */
sfr SMB0DAT     = 0xC2;            /* SMBus0 Data                            */
sfr ADC0GTL     = 0xC3;            /* ADC0 Greater-Than Compare Low          */
sfr ADC0GTH     = 0xC4;            /* ADC0 Greater-Than Compare High         */
sfr ADC0LTL     = 0xC5;            /* ADC0 Less-Than Compare Word Low        */
sfr ADC0LTH     = 0xC6;            /* ADC0 Less-Than Compare Word High       */
sfr XBR2        = 0xC7;            /* Port I/O Crossbar Control 2            */
sfr TMR2CN      = 0xC8;            /* Timer/Counter 2 Control                */
sfr REG0CN      = 0xC9;            /* Regulator Control                      */
sfr LIN0CF      = 0xC9;            /* LIN 0 Configuration                    */
sfr TMR2RLL     = 0xCA;            /* Timer/Counter 2 Reload Low             */
sfr TMR2RLH     = 0xCB;            /* Timer/Counter 2 Reload High            */
sfr TMR2L       = 0xCC;            /* Timer/Counter 2 Low                    */
sfr TMR2H       = 0xCD;            /* Timer/Counter 2 High                   */
sfr PCA0CPL5    = 0xCE;            /* PCA0 Capture 5 Low                     */
sfr PCA0CPH5    = 0xCF;            /* PCA0 Capture 5 High                    */
sfr PSW         = 0xD0;            /* Program Status Word                    */
sfr REF0CN      = 0xD1;            /* Voltage Reference Control              */
sfr LIN0DAT     = 0xD2;            /* LIN0 Data                              */
sfr LIN0ADR     = 0xD3;            /* LIN0 Address                           */
sfr P0SKIP      = 0xD4;            /* Port 0 Skip                            */
sfr P1SKIP      = 0xD5;            /* Port 1 Skip                            */
sfr P2SKIP      = 0xD6;            /* Port 2 Skip                            */
sfr P3SKIP      = 0xD7;            /* Port 3 Skip                            */
sfr PCA0CN      = 0xD8;            /* PCA0 Control                           */
sfr PCA0MD      = 0xD9;            /* PCA0 Mode                              */
sfr PCA0PWM     = 0xD9;            /* PCA0 PWM Control                       */
sfr PCA0CPM0    = 0xDA;            /* PCA0 Module 0 Mode Register            */
sfr PCA0CPM1    = 0xDB;            /* PCA0 Module 1 Mode Register            */
sfr PCA0CPM2    = 0xDC;            /* PCA0 Module 2 Mode Register            */
sfr PCA0CPM3    = 0xDD;            /* PCA0 Module 3 Mode Register            */
sfr PCA0CPM4    = 0xDE;            /* PCA0 Module 4 Mode Register            */
sfr PCA0CPM5    = 0xDF;            /* PCA0 Module 5 Mode Register            */
sfr ACC         = 0xE0;            /* Accumulator                            */
sfr XBR0        = 0xE1;            /* Port I/O Crossbar Control 0            */
sfr XBR1        = 0xE2;            /* Port I/O Crossbar Control 1            */
sfr CCH0CN      = 0xE3;            /* Cache control                          */
sfr IT01CF      = 0xE4;            /* INT0/INT1 Configuration                */
sfr EIE1        = 0xE6;            /* Extended Interrupt Enable 2            */
sfr EIE2        = 0xE7;            /* Extended Interrupt Enable 2            */
sfr ADC0CN      = 0xE8;            /* ADC0 Control                           */
sfr PCA0CPL1    = 0xE9;            /* PCA0 Capture 2 Low                     */
sfr PCA0CPH1    = 0xEA;            /* PCA0 Capture 2 High                    */
sfr PCA0CPL2    = 0xEB;            /* PCA0 Capture 3 Low                     */
sfr PCA0CPH2    = 0xEC;            /* PCA0 Capture 3 High                    */
sfr PCA0CPL3    = 0xED;            /* PCA0 Capture 4 Low                     */
sfr PCA0CPH3    = 0xEE;            /* PCA0 Capture 4 High                    */
sfr RSTSRC      = 0xEF;            /* Reset Source Configuration/Status      */
sfr B           = 0xF0;            /* B Register                             */
sfr P0MAT       = 0xF1;            /* Port 0 Match                           */
sfr P0MDIN      = 0xF1;            /* Port 0 Input Mode                      */
sfr P0MASK      = 0xF2;            /* Port 0 Mask                            */
sfr P1MDIN      = 0xF2;            /* Port 1 Input Mode                      */
sfr P1MAT       = 0xF3;            /* Port 1 Match                           */
sfr P2MDIN      = 0xF3;            /* Port 2 Input Mode                      */
sfr P1MASK      = 0xF4;            /* Port 1 Mask                            */
sfr P3MDIN      = 0xF4;            /* Port 3 Input Mode                      */
sfr EIP1        = 0xF6;            /* External Interrupt Priority 1          */
sfr EIP2        = 0xF7;            /* External Interrupt Priority 2          */
sfr SPI0CN      = 0xF8;            /* SPI0 Control                           */
sfr PCA0L       = 0xF9;            /* PCA0 Counter Low                       */
sfr SN0         = 0xF9;            /* Serial Number 0                        */
sfr PCA0H       = 0xFA;            /* PCA0 Counter High                      */
sfr SN1         = 0xFA;            /* Serial Number 1                        */
sfr PCA0CPL0    = 0xFB;            /* PCA0 Capture 0 Low                     */
sfr SN2         = 0xFB;            /* Serial Number 2                        */
sfr PCA0CPH0    = 0xFC;            /* PCA0 Capture 0 High                    */
sfr SN3         = 0xFC;            /* Serial Number 3                        */
sfr PCA0CPL4    = 0xFD;            /* PCA0 Capture 4 Low                     */
sfr PCA0CPH4    = 0xFE;            /* PCA0 Capture 4 High                    */
sfr VDM0CN      = 0xFF;            /* VDD Monitor Control                    */


/* Page C (CAN0) Registers */
sfr CAN0CFG     = 0x92;            /* CAN0 Clock Configuration               */
sfr CAN0STAT    = 0x94;            /* Status Register Low Byte               */
sfr CAN0ERRL    = 0x96;            /* Error Counter Low Byte                 */
sfr CAN0ERRH    = 0x97;            /* Error Counter High Byte                */
sfr CAN0BTL     = 0x9A;            /* Bit Timing Register Low Byte           */
sfr CAN0BTH     = 0x9B;            /* Bit Timing Register High Byte          */
sfr CAN0IIDL    = 0x9C;            /* Interrupt Register Low Byte            */
sfr CAN0IIDH    = 0x9D;            /* Interrupt Register High Byte           */
sfr CAN0TST     = 0x9E;            /* Test Register Low Byte                 */
sfr CAN0BRPE    = 0xA1;            /* BRP Extension Register Low Byte        */
sfr CAN0TR1L    = 0xA2;            /* Transmission Request 1 Low Byte        */
sfr CAN0TR1H    = 0xA3;            /* Transmission Request 1 High Byte       */
sfr CAN0TR2L    = 0xA4;            /* Transmission Request 2 Low Byte        */
sfr CAN0TR2H    = 0xA5;            /* Transmission Request 2 High Byte       */
sfr CAN0ND1L    = 0xAA;            /* New Data 1 Low Byte                    */
sfr CAN0ND1H    = 0xAB;            /* New Data 1 High Byte                   */
sfr CAN0ND2L    = 0xAC;            /* New Data 2 Low Byte                    */
sfr CAN0ND2H    = 0xAD;            /* New Data 2 High Byte                   */
sfr CAN0IP1L    = 0xAE;            /* Interrupt Pending 1 Low Byte           */
sfr CAN0IP1H    = 0xAF;            /* Interrupt Pending 1 High Byte          */
sfr CAN0IP2L    = 0xB2;            /* Interrupt Pending 2 Low Byte           */
sfr CAN0IP2H    = 0xB3;            /* Interrupt Pending 2 High Byte          */
sfr CAN0MV1L    = 0xBA;            /* Message Valid 1 Low Byte               */
sfr CAN0MV1H    = 0xBB;            /* Message Valid 1 High Byte              */
sfr CAN0MV2L    = 0xBC;            /* Message Valid 2 Low Byte               */
sfr CAN0MV2H    = 0xBD;            /* Message Valid 2 High Byte              */
sfr CAN0IF1CRL  = 0xBE;            /* IF1 Command Request Low Byte           */
sfr CAN0IF1CRH  = 0xBF;            /* IF1 Command Request High Byte          */
sfr CAN0CN      = 0xC0;            /* CAN Control Register Low Byte          */
sfr CAN0IF1CML  = 0xC2;            /* IF1 Command Mask Low Byte              */
sfr CAN0IF1CMH  = 0xC3;            /* IF1 Command Mask High Byte             */
sfr CAN0IF1M1L  = 0xC4;            /* IF1 Mask 1 Low Byte                    */
sfr CAN0IF1M1H  = 0xC5;            /* IF1 Mask 1 High Byte                   */
sfr CAN0IF1M2L  = 0xC6;            /* IF1 Mask 2 Low Byte                    */
sfr CAN0IF1M2H  = 0xC7;            /* IF1 Mask 2 High Byte                   */
sfr CAN0IF1A1L  = 0xCA;            /* IF1 Arbitration 1 Low Byte             */
sfr CAN0IF1A1H  = 0xCB;            /* IF1 Arbitration 1 High Byte            */
sfr CAN0IF1A2L  = 0xCC;            /* IF1 Arbitration 2 Low Byte             */
sfr CAN0IF1A2H  = 0xCD;            /* IF1 Arbitration 2 High Byte            */
sfr CAN0IF2MCL  = 0xCE;            /* IF2 Message Control Low Byte           */
sfr CAN0IF2MCH  = 0xCF;            /* IF2 Message Control High Byte          */
sfr CAN0IF1MCL  = 0xD2;            /* IF1 Message Control Low Byte           */
sfr CAN0IF1MCH  = 0xD3;            /* IF1 Message Control High Byte          */
sfr CAN0IF1DA1L = 0xD4;            /* IF1 Data A 1 Low Byte                  */
sfr CAN0IF1DA1H = 0xD5;            /* IF1 Data A 1 High Byte                 */
sfr CAN0IF1DA2L = 0xD6;            /* IF1 Data A 2 Low Byte                  */
sfr CAN0IF1DA2H = 0xD7;            /* IF1 Data A 2 High Byte                 */
sfr CAN0IF1DB1L = 0xDA;            /* IF1 Data B 1 Low Byte                  */
sfr CAN0IF1DB1H = 0xDB;            /* IF1 Data B 1 High Byte                 */
sfr CAN0IF1DB2L = 0xDC;            /* IF1 Data B 2 Low Byte                  */
sfr CAN0IF1DB2H = 0xDD;            /* IF1 Data B 2 High Byte                 */
sfr CAN0IF2CRL  = 0xDE;            /* IF2 Command Request Low Byte           */
sfr CAN0IF2CRH  = 0xDF;            /* IF2 Command Request High Byte          */
sfr CAN0IF2CML  = 0xE2;            /* IF2 Command Mask Low Byte              */
sfr CAN0IF2CMH  = 0xE3;            /* IF2 Command Mask High Byte             */
sfr CAN0IF2M1L  = 0xEA;            /* IF2 Mask 1 Low Byte                    */
sfr CAN0IF2M1H  = 0xEB;            /* IF2 Mask 1 High Byte                   */
sfr CAN0IF2M2L  = 0xEC;            /* IF2 Mask 2 Low Byte                    */
sfr CAN0IF2M2H  = 0xED;            /* IF2 Mask 2 High Byte                   */
sfr CAN0IF2A1L  = 0xEE;            /* IF2 Arbitration 1 Low Byte             */
sfr CAN0IF2A1H  = 0xEF;            /* IF2 Arbitration 1 High Byte            */
sfr CAN0IF2A2L  = 0xF2;            /* IF2 Arbitration 2 Low Byte             */
sfr CAN0IF2A2H  = 0xF3;            /* IF2 Arbitration 2 High Byte            */
sfr CAN0IF2DA1L = 0xF6;            /* IF2 Data A 1 Low Byte                  */
sfr CAN0IF2DA1H = 0xF7;            /* IF2 Data A 1 High Byte                 */
sfr CAN0IF2DA2L = 0xFA;            /* IF2 Data A 2 Low Byte                  */
sfr CAN0IF2DA2H = 0xFB;            /* IF2 Data A 2 High Byte                 */
sfr CAN0IF2DB1L = 0xFC;            /* IF2 Data B 1 Low Byte                  */
sfr CAN0IF2DB1H = 0xFD;            /* IF2 Data B 1 High Byte                 */
sfr CAN0IF2DB2L = 0xFE;            /* IF2 Data B 2 Low Byte                  */
sfr CAN0IF2DB2H = 0xFF;            /* IF2 Data B 2 High Byte                 */

