tienlonghungson/Hands-On-Embedded-System/Keil5/C51/INC/Cygnal/REG51F550.H
/* 16-bit Register Definitions */

sfr16 DP        = 0x82;            /* Data Pointer                           */
sfr16 TMR3RL    = 0x92;            /* Timer3 Reload                          */
sfr16 TMR3      = 0x94;            /* Timer3 Capture / Reload                */
sfr16 SBRL0     = 0xAC;            /* UART0 Reload                           */
sfr16 ADC0      = 0xBD;            /* ADC0 data                              */
sfr16 ADC0GT    = 0xC3;            /* ADC0 Greater Than Window               */
sfr16 ADC0LT    = 0xC5;            /* ADC0 Less Than Window                  */
sfr16 TMR2RL    = 0xCA;            /* Timer 2 Reload                         */
sfr16 TMR2      = 0xCC;            /* Timer2 Capture / Reload                */
sfr16 PCA0CP5   = 0xCE;            /* PCA0 Module 5 Capture                  */
sfr16 PCA0CP1   = 0xE9;            /* PCA0 Module 1 Capture                  */
sfr16 PCA0CP2   = 0xEB;            /* PCA0 Module 2 Capture                  */
sfr16 PCA0CP3   = 0xED;            /* PCA0 Module 3 Capture                  */
sfr16 PCA0      = 0xF9;            /* PCA0 Counter                           */
sfr16 PCA0CP0   = 0xFB;            /* PCA0 Module 0 Capture                  */
sfr16 PCA0CP4   = 0xFD;            /* PCA0 Module 4 Capture                  */

sfr16 CAN0ERR   = 0x96;            /* Error Counter                          */
sfr16 CAN0BT    = 0x9A;            /* Bit Timing Register                    */
sfr16 CAN0IID   = 0x9C;            /* Interrupt Register                     */
sfr16 CAN0TR1   = 0xA2;            /* Transmission Request 1                 */
sfr16 CAN0TR2   = 0xA4;            /* Transmission Request 2                 */
sfr16 CAN0ND1   = 0xAA;            /* New Data 1                             */
sfr16 CAN0ND2   = 0xAC;            /* New Data 2                             */
sfr16 CAN0IP1   = 0xAE;            /* Interrupt Pending 1                    */
sfr16 CAN0IP2   = 0xB2;            /* Interrupt Pending 2                    */
sfr16 CAN0MV1   = 0xBA;            /* Message Valid 1                        */
sfr16 CAN0MV2   = 0xBC;            /* Message Valid 2                        */
sfr16 CAN0IF1CR = 0xBE;            /* IF1 Command Request                    */
sfr16 CAN0IF1CM = 0xC2;            /* IF1 Command Mask                       */
sfr16 CAN0IF1M1 = 0xC4;            /* IF1 Mask 1                             */
sfr16 CAN0IF1M2 = 0xC6;            /* IF1 Mask 2                             */
sfr16 CAN0IF1A1 = 0xCA;            /* IF1 Arbitration 1                      */
sfr16 CAN0IF1A2 = 0xCC;            /* IF1 Arbitration 2                      */
sfr16 CAN0IF2MC = 0xCE;            /* IF2 Message Control                    */
sfr16 CAN0IF1MC = 0xD2;            /* IF1 Message Control                    */
sfr16 CAN0IF1DA1= 0xD4;            /* IF1 Data A 1                           */
sfr16 CAN0IF1DA2= 0xD6;            /* IF1 Data A 2                           */
sfr16 CAN0IF1DB1= 0xDA;            /* IF1 Data B 1                           */
sfr16 CAN0IF1DB2= 0xDC;            /* IF1 Data B 2                           */
sfr16 CAN0IF2CR = 0xDE;            /* IF2 Command Request                    */
sfr16 CAN0IF2CM = 0xE2;            /* IF2 Command Mask                       */
sfr16 CAN0IF2M1 = 0xEA;            /* IF2 Mask 1                             */
sfr16 CAN0IF2M2 = 0xEC;            /* IF2 Mask 2                             */
sfr16 CAN0IF2A1 = 0xEE;            /* IF2 Arbitration 1                      */
sfr16 CAN0IF2A2 = 0xF2;            /* IF2 Arbitration 2                      */
sfr16 CAN0IF2DA1= 0xF6;            /* IF2 Data A 1                           */
sfr16 CAN0IF2DA2= 0xFA;            /* IF2 Data A 2                           */
sfr16 CAN0IF2DB1= 0xFC;            /* IF2 Data B 1                           */
sfr16 CAN0IF2DB2= 0xFE;            /* IF2 Data B 2                           */


/* Bit Definitions */

/* TCON 0x88 */
sbit TF1      = TCON^7;            /* Timer 1 Overflow Flag                  */
sbit TR1      = TCON^6;            /* Timer 1 On/Off Control                 */
sbit TF0      = TCON^5;            /* Timer 0 Overflow Flag                  */
sbit TR0      = TCON^4;            /* Timer 0 On/Off Control                 */
sbit IE1      = TCON^3;            /* Ext. Interrupt 1 Edge Flag             */
sbit IT1      = TCON^2;            /* Ext. Interrupt 1 Type                  */
sbit IE0      = TCON^1;            /* Ext. Interrupt 0 Edge Flag             */
sbit IT0      = TCON^0;            /* Ext. Interrupt 0 Type                  */

/* SCON0 0x98 */
sbit OVR0     = SCON0^7;           /* UART0 Mode 0                           */
sbit PERR0    = SCON0^6;           /* UART0 Parity Error Flag                */
sbit THRE0    = SCON0^5;           /* UART0 Transmit Holding Reg. Empty      */
sbit REN0     = SCON0^4;           /* UART0 RX Enable                        */
sbit TBX0     = SCON0^3;           /* UART0 TX Bit 8                         */
sbit RBX0     = SCON0^2;           /* UART0 RX Bit 8                         */
sbit TI0      = SCON0^1;           /* UART0 TX Interrupt Flag                */
sbit RI0      = SCON0^0;           /* UART0 RX Interrupt Flag                */

/* IE 0xA8 */
sbit EA       = IE^7;              /* Global Interrupt Enable                */
sbit ESPI0    = IE^6;              /* SPI0 Interrupt Enable                  */
sbit ET2      = IE^5;              /* Timer 2 Interrupt Enable               */
sbit ES0      = IE^4;              /* UART0 Interrupt Enable                 */
sbit ET1      = IE^3;              /* Timer 1 Interrupt Enable               */
sbit EX1      = IE^2;              /* External Interrupt 1 Enable            */
sbit ET0      = IE^1;              /* Timer 0 Interrupt Enable               */
sbit EX0      = IE^0;              /* External Interrupt 0 Enable            */

/* IP 0xB8 */
                                   /* Bit 7 unused                           */
sbit PSPI0    = IP^6;              /* SPI0 Interrupt Priority                */
sbit PT2      = IP^5;              /* Timer 2 Priority                       */
sbit PS0      = IP^4;              /* UART0 Priority                         */
sbit PS       = IP^4;              /* UART0 Priority                         */
sbit PT1      = IP^3;              /* Timer 1 Priority                       */
sbit PX1      = IP^2;              /* External Interrupt 1 Priority          */
sbit PT0      = IP^1;              /* Timer 0 Priority                       */
sbit PX0      = IP^0;              /* External Interrupt 0 Priority          */

/* SMB0CN 0xC0 */
sbit MASTER   = SMB0CN^7;          /* SMBus0 Master/Slave Indicator          */
sbit TXMODE   = SMB0CN^6;          /* SMBus0 Transmit Mode Indicator         */
sbit STA      = SMB0CN^5;          /* SMBus0 Start Flag                      */
sbit STO      = SMB0CN^4;          /* SMBus0 Stop Flag                       */
sbit ACKRQ    = SMB0CN^3;          /* SMBus0 Acknowledge Request             */
sbit ARBLOST  = SMB0CN^2;          /* SMBus0 Arbitration Lost Indicator      */
sbit ACK      = SMB0CN^1;          /* SMBus0 Acknowledge                     */
sbit SI       = SMB0CN^0;          /* SMBus0 Interrupt Flag                  */

