tienlonghungson/Hands-On-Embedded-System/Keil5/C51/INC/Cygnal/REG51F550.H
/* TMR2CN 0xC8 */
sbit TF2H    = TMR2CN^7;           /* Timer 2 High-Byte Overflow Flag        */
sbit TF2L    = TMR2CN^6;           /* Timer 2 Low-Byte  Overflow Flag        */
sbit TF2LEN  = TMR2CN^5;           /* Timer 2 Low-Byte Flag Enable           */
sbit TF2CEN  = TMR2CN^4;           /* Timer 2 Capture Enable                 */
sbit T2SPLIT = TMR2CN^3;           /* Timer 2 Split-Mode Enable              */
sbit TR2     = TMR2CN^2;           /* Timer2 Run Enable                      */
                                   /* Unused                                 */
sbit T2XCLK  = TMR2CN^0;           /* Timer 2 Clk/8 Clock Source             */

/* PSW 0xD0 */
sbit CY      = PSW^7;              /* Carry Flag                             */
sbit AC      = PSW^6;              /* Auxiliary Carry Flag                   */
sbit F0      = PSW^5;              /* User Flag 0                            */
sbit RS1     = PSW^4;              /* Register Bank Select 1                 */
sbit RS0     = PSW^3;              /* Register Bank Select 0                 */
sbit OV      = PSW^2;              /* Overflow Flag                          */
sbit F1      = PSW^1;              /* User Flag 1                            */
sbit P       = PSW^0;              /* Accumulator Parity Flag                */

/* PCA0CN 0xD8 */
sbit CF      = PCA0CN^7;           /* PCA0 Counter Overflow Flag             */
sbit CR      = PCA0CN^6;           /* PCA0 Counter Run Control Bit           */
sbit CCF5    = PCA0CN^5;           /* PCA0 Module 5 Interrupt Flag           */
sbit CCF4    = PCA0CN^4;           /* PCA0 Module 4 Interrupt Flag           */
sbit CCF3    = PCA0CN^3;           /* PCA0 Module 3 Interrupt Flag           */
sbit CCF2    = PCA0CN^2;           /* PCA0 Module 2 Interrupt Flag           */
sbit CCF1    = PCA0CN^1;           /* PCA0 Module 1 Interrupt Flag           */
sbit CCF0    = PCA0CN^0;           /* PCA0 Module 0 Interrupt Flag           */

/* ADC0CN 0xE8 */
sbit AD0EN   = ADC0CN^7;           /* ADC0 Enable                            */
sbit BURSTEN = ADC0CN^6;           /* ADC0 Burst Enable                      */
sbit AD0INT  = ADC0CN^5;           /* ADC0 EOC Interrupt Flag                */
sbit AD0BUSY = ADC0CN^4;           /* ADC0 Busy Flag                         */
sbit AD0WINT = ADC0CN^3;           /* ADC0 Window Compare Interrupt Flag     */
sbit AD0LJST = ADC0CN^2;           /* ADC0 Left Justified                    */
sbit AD0CM1  = ADC0CN^1;           /* ADC0 Start Of Conversion Mode Bit 1    */
sbit AD0CM0  = ADC0CN^0;           /* ADC0 Start Of Conversion Mode Bit 0    */

/* SPI0CN 0xF8 */
sbit SPIF    = SPI0CN^7;           /* SPI0 Interrupt Flag                    */
sbit WCOL    = SPI0CN^6;           /* SPI0 Write Collision Flag              */
sbit MODF    = SPI0CN^5;           /* SPI0 Mode Fault Flag                   */
sbit RXOVRN  = SPI0CN^4;           /* SPI0 RX Overrun Flag                   */
sbit NSSMD1  = SPI0CN^3;           /* SPI0 Slave Select Mode 1               */
sbit NSSMD0  = SPI0CN^2;           /* SPI0 Slave Select Mode 0               */
sbit TXBMT   = SPI0CN^1;           /* SPI0 TX Buffer Empty Flag              */
sbit SPIEN   = SPI0CN^0;           /* SPI0 Enable                            */


/* LIN0 Indirectly Addressable Registers */
#define  LIN0DT1   0x00            /* LIN0 Data Byte 1                       */
#define  LIN0DT2   0x01            /* LIN0 Data Byte 2                       */
#define  LIN0DT3   0x02            /* LIN0 Data Byte 3                       */
#define  LIN0DT4   0x03            /* LIN0 Data Byte 4                       */
#define  LIN0DT5   0x04            /* LIN0 Data Byte 5                       */
#define  LIN0DT6   0x05            /* LIN0 Data Byte 6                       */
#define  LIN0DT7   0x06            /* LIN0 Data Byte 7                       */
#define  LIN0DT8   0x07            /* LIN0 Data Byte 8                       */
#define  LIN0CTRL  0x08            /* LIN0 Control                           */
#define  LIN0ST    0x09            /* LIN0 Status                            */
#define  LIN0ERR   0x0A            /* LIN0 Error                             */
#define  LIN0SIZE  0x0B            /* LIN0 Message Size                      */
#define  LIN0DIV   0x0C            /* LIN0 Divider                           */
#define  LIN0MUL   0x0D            /* LIN0 Multiplier                        */
#define  LIN0ID    0x0E            /* LIN0 Identifier                        */


#endif                                 /* #define __REG51F550_H__            */
